# print - გამოიტანოს მესიჯი ეკრანზე/ტერმინალში

# print("Hello World")

# მონაცემთა ტიპები

# Integer - რიცხვითი მნიშვნელობა - 0, 1, 10, 100
# String - ტექსტური მნიშვნელობა - "Hello"  "5" 
# Float - ათწილადი - 1.1,  15.3,  25.1 

# ზოგადად, პითონში რაც არის ჩასმული ბრჭყალებში ყველაფერი არის String

# პროგრამირებაში მონაცემთა ტიპებს აქვს ძალიან დიდი მნიშვნელობა. მაგ. ტექსტურ მნიშვნელობებს ვიყენებთ, რომ გამოვიტანოთ ტექსტი. რიცხვით მნიშვნელობებს(integer) ვიყენებთ, რომ გამოვიტანოთ ორი რიცხვის ჯამი და Float-საც ვიყენებთ მსგავსი ლოგიკისთვის. ყველაფერს აქვს თავისი დანიშნულება და თავისი ადგილი, სადაც ვიყენებთ.

# print("Hello World 97")
# print(10)
# print(10.5)

# print(10 + 15)

# ცვლადები - ტექსტური მნიშვნელობისთვის - String

# ცვლადში ინახება რაღაც კონკრეტული ინფორმაცია/კონკრეტული მნიშვნელობა.
# ცვლადში შეგვიძლია შევიტანოთ ინფორმაცია საკუთარ თავზე - სახელი, გვარი, ასაკი, პროფესია... შეგვიძლია შევიტანოთ სხვადასხვა მონაცემთა ტიპები, რომლებსაც შემდგომ უკვე გავაერთიანებთ და გამოვიტანთ ერთად.

# name = "Tamari"
# lastname = "Margiani"
# proffesion = "Web developer"

# ცვლადი აუცილებლად უნდა შეიქმნას ტექსტური მნიშვნელობებით.
# პირველ რიგში ცვლადს ვანიჭებთ დასახელებას, შემდეგ უკვე ვიყენებთ ტოლობის სიმბოლოს და ვანიჭებთ(შეგვყავს) მნიშვნელობას. მნიშვნელობა უნდა იყოს ბრჭყალებში ჩასმული.
# ჩვენ შეგვიძლია შენახული ინფორმაციები გამოვიტანოთ ყოველ ჯერზე, როცა ეს დაგვჭირდება.

# print(name)
# print(lastname)

# snake case - ქვედა ტირით სიტყვების გამოყოფა ერთმანეთისაგან
# Hello_how_are_you = "a"

# ცვლადის შექმნა აუცილებლად უნდა დავიწყოთ ტექსტური მნიშვნელობით

# print(name)
# print(lastname)
# print(proffesion)

# print(name, lastname, proffesion)
# print(name + lastname + proffesion) - ამ დროს იქმნება კონკატინაცია ანუ ერთმანეთზე დამატებულ ტექსტურ მნიშვნელობებს ეწოდებათ კონკატინაცია
# print(name + ' ' + lastname + ' ' +  proffesion)
# უბრალოდ ცარიელ ბრჭყალებსაც '' "" String ეწოდება.
# კონკატინაცია არის როდესაც რამოდენიმე String მნიშვნელობას ვამატებთ ერთმანეთს
# მოვნიშნოთ ყველა სტრიქონი რომლის გადაქცევაც გვინდა კომენტარად და დავაჭიროთ Ctrl + ? 

# name = "Tamari"

# experience = 2

# countity = 15.5

# # countity - რაოდენობა

# # პითონში არ შეგვიძლია რიცხვით მნიშვნელობას დავამატო ტექსტური მნიშვნელობა და დავამატო ათწილადი

# print(name, experience + countity)

# print(name + experience + countity)


# მათემატიკური ოპერატორები
#    +   -   /   * 

# print(5 + 5)
# print(15 - 5)
# print(5 / 5)
# print(15 / 2)  # გაყოფის დროს ერთ დახრილ ხაზს ვიყენებთ, როდესაც გვინდა გამოგვიტანოს ზუსტი მნიშვნელობა
# print(15 // 2) # გაყოფის დროს ორ დახრილ ხაზს ვიყენებთ, როდესაც გვინდა გამოგვიტანოს დამრგვალებული მნიშვნელობა
# print(5 * 5)

# # ცვლადები რიცხვითი მნიშვნელობისთვის - Integer

# x = 10
# y = 20
# z = 30

# print(x + y + z)
# print(x + y / z) # ჯერ ასრულებს გაყოფას და შემდეგ მიმატებას. რა სინტაქსი უნდა გამოვიყენო, რომ ჯერ მიმატება შეასრულოს და შემდეგ გაყოფა?

# print(x + y - z)

# მეთოდი რომელიც გვაჩვენებს კონკრეტული მონაცემის ტიპს  - TYPE

# name = 'Avto'
# year = 30
# float = 11.4
# x = '10' # ეს სტრინგია(String) თუ ინტეჯერი(Integer?

# type() - გვიჩვენებს მონაცემის ტიპს -  მეთოდი გამოიყენება იმისთვის, რომ გვაჩვენოს ჩვენ რა ტიპის მნიშვნელობა არის ცვლადზე მინიჭებული  - String, Integer თუ Float და ა.შ. 

# () - რკალური ფრჩხილები
# {} - ხვეული ფრჩხილები

# print(type(name))
# print(type(year))
# print(type(float))
# print(type(x))

# ეს საჭიროა რომ გავიგოთ რომელ მონაცემის ტიპთან გვაქვს საქმე

# ბრჭყალები

''
""
# I will see you
# I'll see you

print(' I will see you ')
# print (' I'll see you') - სინტაქსის შეცდომა - ვერ ხვდება პროგრამა რომელი ბრჭყალია საჭირო და რომელი არა
print(" I'll see you ")
