# HOMEWORK

# 1. Sololearn-ზე რეგისტრაცია  +

# 2. Sololearn-ის დავალება + 

# 3. 5 ცვლადი საკუთარ თავზე 

name = 'Tamari'
lastname = 'Margiani'
age = 32
academy = 'GOA'
proffesion = 'student'

print(name, lastname, age, academy, proffesion)

print(name + ' ' + lastname + ' ' + str('32') + ' ' + academy + ' ' + proffesion )


# 4. მათემატიკური ოპერატორები 

print(5 + 5)
print(23 -9)
print(67 * 15)
print(90 / 4)
print(90 // 4)


# 5. 5 მაგალითი Type() მეთოდზე

name = 'Tamuna'
age = 25
experience = 4.5
proffesion = 'web developer'
x = '57'

print(type(name))
print(type(age))
print(type(experience))
print(type(proffesion))
print(type(x))


# 6. ნასწავლი საკითხები 

# Python - ყველაზე პოპულარული პროგრამირების ენა. 

# print('') - გამოაქვს მესიჯი(ტექსტი) ეკრანზე/ტერმინალში

# მონაცემთა ტიპები

# Integer - რიცხვითი მნიშვნელობა - ვიყენებთ რიცხვითი მნიშვნელობების გამოსატანად, მათემატიკურ ოპერატორებზე მაგალითების შესადგენად...
# String - ტექსტური მნიშვნელობა - ვიყენებთ, რომ გამოვიტანოთ ტექსტი. ზოგადად, პითონში რაც არის ჩასმული ბრჭყალებში ყველაფერი არის String.
# Float - ათწილადი - ვიყენებთ ეკრანზე/ტერმინალში ათწილადების გამოსატანად და მათემატიკური მოქმედებების შესასრულებლად.

# ცვლადები

# ცვლადში ინახება კონკრეტული ინფორმაცია/კონკრეტული მნიშვნელობა.
# ცვლადის შექმნა აუცილებლად უნდა დავიწყოთ ტექსტური მნიშვნელობით. პირველ რიგში ცვლადს ვანიჭებთ დასახელებას, შემდეგ ვსვამთ ტოლობის სიმბოლოს და ვანიჭებთ მნიშვნელობას.
# მაგ. name = 'Tamari'  
# გვაქვს ცვლადი რიცხვითი მნიშვნელობისთვის. მაგ. x = 4 ამ შემთხვევაში მნიშვნელობას ბრჭყალებში არ ვსვამთ.
# ტექსტური მნიშვნელობების ერთმანეთზე დამატებას კონკატინაცია ეწოდება. პითონში შეუძლებელია რიცხვითი მნიშვნელობის ან ათწილადის დამატება ტექსტურ მნიშვნელობაზე.
# ათწილადის და ინტეჯერის ერთმანეთზე დამატება შესაძლებელია. 

# მათემატიკური ოპერატორები - მათემატიკური მაგალითების შესადგენად
#    +   -   /   * 

# print(x + y)
# print(x - y)
# print(x / y)  # გაყოფის დროს ერთ დახრილ ხაზს ვიყენებთ, როდესაც გვინდა გამოგვიტანოს ზუსტი მნიშვნელობა
# print(x // y) # გაყოფის დროს ორ დახრილ ხაზს ვიყენებთ, როდესაც გვინდა გამოგვიტანოს დამრგვალებული მნიშვნელობა
# print(x * y)


# type() - გვიჩვენებს მონაცემის ტიპს -  მეთოდი გამოიყენება იმისთვის, რომ გვაჩვენოს რა ტიპის მნიშვნელობა არის ცვლადზე მინიჭებული  - String, Integer თუ Float და ა.შ. 
